# -*- coding: utf-8 -*-


def change_keyboard(word):
    alphabet = {
        'q': u'й', 'Q': u'Й', 'w': u'ц', 'W': u'Ц', 'e': u'у', 'E': u'У',
        'r': u'к', 'R': u'К', 't': u'е', 'T': u'Е', 'y': u'н', 'Y': u'Н',
        'u': u'г', 'U': u'Г', 'i': u'ш', 'I': u'Ш', 'o': u'щ', 'O': u'Щ',
        'p': u'з', 'P': u'З', '[': u'х', '[': u'Х', ']': u'ъ', ']': u'Ъ',
        'a': u'ф', 'A': u'Ф', 's': u'ы', 'S': u'Ы', 'd': u'в', 'D': u'В',
        'f': u'а', 'F': u'А', 'g': u'п', 'G': u'П', 'h': u'р', 'H': u'Р',
        'j': u'о', 'J': u'О', 'k': u'л', 'K': u'Л', 'l': u'д', 'L': u'Д',
        ';': u'ж', ':': u'Ж', '\'': u'э', '"': u'Э', 'z': u'я', 'Z': u'Я',
        'x': u'ч', 'X': u'Ч', 'c': u'с', 'C': u'С', 'v': u'м', 'V': u'М',
        'b': u'и', 'B': u'И', 'n': u'т', 'N': u'Т', 'm': u'ь', 'M': u'Ъ',
        ',': u'б', '<': u'Б', '.': u'ю', '>': u'Ю'}
    return word and ('').join(map(lambda i: alphabet.get(i, i), word))
